Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.NonUniquePropertySetName
The value of the given parameter is already in use as a property set name.

Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.NonStringParameterValue
The given parameter requires a string value.

Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures.EmptyPropertySetName
A property set name cannot be an empty string.

Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures
Failures related to property set elements.